xhbws/send/api_incluir.txt

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://app.omie.com.br/api/v1/geral/clientes/?WSDL">
   <soapenv:Header>
      <app_key>9884378119</app_key>
      <app_secret>d26a64b7ce3542bf7c1ef8469320b29d</app_secret>
   </soapenv:Header>
   <soapenv:Body>
      <wsdl:IncluirCliente soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <clientes_cadastro xsi:type="wsdl:clientes_cadastro">
            <codigo_cliente_omie xsi:type="xsd:integer"></codigo_cliente_omie>
            <codigo_cliente_integracao xsi:type="xsd:string">A125</codigo_cliente_integracao>
            <cnpj_cpf xsi:type="xsd:string">1212312300011</cnpj_cpf>
            <razao_social xsi:type="xsd:string">NewAge Software</razao_social>
            <nome_fantasia xsi:type="xsd:string">NewAge Software</nome_fantasia>
            <logradouro xsi:type="xsd:string">Rua</logradouro>
            <endereco xsi:type="xsd:string">Gomes de Carvalho</endereco>
            <endereco_numero xsi:type="xsd:string">1666</endereco_numero>
            <complemento xsi:type="xsd:string">12 andar</complemento>
            <bairro xsi:type="xsd:string">Vila Olimpia</bairro>
            <cidade xsi:type="xsd:string">São Paulo</cidade>
            <estado xsi:type="xsd:string">SP</estado>
            <cep xsi:type="xsd:string"></cep>
            <codigo_pais xsi:type="xsd:string"></codigo_pais>
            <contato xsi:type="xsd:string">comercial</contato>
            <telefone1_ddd xsi:type="xsd:string">11</telefone1_ddd>
            <telefone1_numero xsi:type="xsd:string">37757888</telefone1_numero>
            <telefone2_ddd xsi:type="xsd:string"></telefone2_ddd>
            <telefone2_numero xsi:type="xsd:string"></telefone2_numero>
            <fax_ddd xsi:type="xsd:string"></fax_ddd>
            <fax_numero xsi:type="xsd:string"></fax_numero>
            <email xsi:type="xsd:string">comercial@omie.com.br</email>
            <homepage xsi:type="xsd:string">www.omie.com.br</homepage>
            <observacao xsi:type="xsd:string">Teste de inclusão via API - teste 2</observacao>
            <inscricao_municipal xsi:type="xsd:string"></inscricao_municipal>
            <inscricao_estadual xsi:type="xsd:string"></inscricao_estadual>
            <inscricao_suframa xsi:type="xsd:string"></inscricao_suframa>
            <pessoa_fisica xsi:type="xsd:string">N</pessoa_fisica>
            <optante_simples_nacional xsi:type="xsd:string">N</optante_simples_nacional>
         </clientes_cadastro>
      </wsdl:IncluirCliente>
   </soapenv:Body>
</soapenv:Envelope>